# SteelElemWeldMainPrepdepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldMainPrepdepth Property
ParameterTypeId Class See Also
---
"Main Preparation Depth"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldMainPrepdepth { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldMainPrepdepth As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldMainPrepdepth {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace